{"format": "graph-model", "generatedBy": "2.4.1", "convertedBy": "TensorFlow.js Converter v3.6.0", "signature": {"outputs": {"add_37": {"name": "add_37"}}}, "modelTopology": {"node": [{"name": "Variable_47", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}]}}}}}, {"name": "moments_15/variance/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "Const_44", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Variable_44", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}]}}}}}, {"name": "moments_14/variance/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "Const_41", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "Variable_42", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "4"}, {"size": "8"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Variable_41", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "8"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "moments_13/variance/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "Const_39", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}}}, {"name": "Variable_39", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "8"}, {"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Variable_38", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}}}, {"name": "moments_12/variance/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "Const_37", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Variable_35", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}}}, {"name": "moments_11/variance/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "Const_34", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Variable_32", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}}}, {"name": "moments_10/variance/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "Const_31", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Variable_29", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "moments_9/variance/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "Const_28", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "Variable_26", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}}}, {"name": "moments_8/variance/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "Const_25", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "Variable_23", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}}}, {"name": "moments_7/variance/reduction_indices", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "Const_22", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "Variable_20", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}}}, {"name": "moments_6/variance/reduction_indices", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "Const_19", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Variable_17", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "moments_5/variance/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "Const_16", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Variable_14", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}}}, {"name": "moments_4/variance/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "Const_13", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Variable_11", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}}}, {"name": "moments_3/variance/reduction_indices", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "Const_10", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Variable_8", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}}}, {"name": "moments_2/variance/reduction_indices", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "Const_7", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Variable_5", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "8"}]}}}}}, {"name": "moments_1/variance/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "Const_4", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Variable_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "moments/variance/reduction_indices", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "Const_1", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "Const", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}, {"size": "2"}]}}}}}, {"name": "Variable", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "9"}, {"size": "9"}, {"size": "3"}, {"size": "4"}]}}}}}, {"name": "moments/mean/reduction_indices", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "Variable_1", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}]}}}}}, {"name": "Const_3", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}, {"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "Variable_3", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "4"}, {"size": "8"}]}}}}}, {"name": "moments_1/mean/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "Variable_4", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "8"}]}}}}}, {"name": "Const_6", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}, {"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "Variable_6", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "8"}, {"size": "16"}]}}}}}, {"name": "moments_2/mean/reduction_indices", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "Variable_7", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}}}, {"name": "Const_9", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}, {"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "Variable_9", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "16"}, {"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "moments_3/mean/reduction_indices", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "Variable_10", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}}}, {"name": "Const_12", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}, {"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "Variable_12", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "16"}, {"size": "16"}]}}}}}, {"name": "moments_4/mean/reduction_indices", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "Variable_13", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Const_15", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}, {"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "Variable_15", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "16"}, {"size": "16"}]}}}}}, {"name": "moments_5/mean/reduction_indices", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "Variable_16", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}}}, {"name": "Const_18", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}, {"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "Variable_18", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "16"}, {"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "moments_6/mean/reduction_indices", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "Variable_19", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}}}, {"name": "Const_21", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}, {"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "Variable_21", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "16"}, {"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "moments_7/mean/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "Variable_22", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Const_24", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}, {"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "Variable_24", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "16"}, {"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "moments_8/mean/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "Variable_25", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Const_27", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}, {"size": "2"}]}}}}}, {"name": "Variable_27", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "16"}, {"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "moments_9/mean/reduction_indices", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "Variable_28", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}}}, {"name": "Const_30", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}, {"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "Variable_30", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "16"}, {"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "moments_10/mean/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "Variable_31", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Const_33", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}, {"size": "2"}]}}}}}, {"name": "Variable_33", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "16"}, {"size": "16"}]}}}}}, {"name": "moments_11/mean/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "Variable_34", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Const_36", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}, {"size": "2"}]}}}}}, {"name": "Variable_36", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "16"}, {"size": "16"}]}}}}}, {"name": "moments_12/mean/reduction_indices", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "Variable_37", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}}}, {"name": "moments_13/mean/reduction_indices", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "Variable_40", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "8"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "moments_14/mean/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "Variable_43", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}]}}}}}, {"name": "Const_43", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}, {"size": "2"}]}}}}}, {"name": "Variable_45", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "9"}, {"size": "9"}, {"size": "4"}, {"size": "3"}]}}}}}, {"name": "moments_15/mean/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "Variable_46", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}]}}}}}, {"name": "Const_46", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "Const_47", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "img_placeholder", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "1"}, {"size": "540"}, {"size": "540"}, {"size": "3"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MirrorPad", "op": "MirrorPad", "input": ["img_placeholder", "Const"], "attr": {"mode": {"s": "UkVGTEVDVA=="}, "Tpaddings": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "Conv2D", "op": "Conv2D", "input": ["MirrorPad", "Variable"], "device": "/device:CPU:0", "attr": {"use_cudnn_on_gpu": {"b": true}, "padding": {"s": "VkFMSUQ="}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "T": {"type": "DT_FLOAT"}}}, {"name": "moments/mean", "op": "Mean", "input": ["Conv2D", "moments/mean/reduction_indices"], "attr": {"Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "moments/SquaredDifference", "op": "SquaredDifference", "input": ["Conv2D", "moments/mean"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "sub", "op": "Sub", "input": ["Conv2D", "moments/mean"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "moments/variance", "op": "Mean", "input": ["moments/SquaredDifference", "moments/variance/reduction_indices"], "attr": {"Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "add", "op": "Add", "input": ["moments/variance", "Const_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "pow", "op": "Rsqrt", "input": ["add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "truediv", "op": "Mul", "input": ["Variable_2", "pow"], "attr": {"_grappler_ArithmeticOptimizer_MinimizeBroadcasts": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "mul", "op": "Mul", "input": ["truediv", "sub"], "attr": {"_grappler_ArithmeticOptimizer_MinimizeBroadcasts": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "add_1", "op": "Add", "input": ["mul", "Variable_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Relu", "op": "Relu", "input": ["add_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "MirrorPad_1", "op": "MirrorPad", "input": ["Relu", "Const_3"], "attr": {"Tpaddings": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "mode": {"s": "UkVGTEVDVA=="}}}, {"name": "Conv2D_1", "op": "Conv2D", "input": ["MirrorPad_1", "Variable_3"], "device": "/device:CPU:0", "attr": {"strides": {"list": {"i": ["1", "2", "2", "1"]}}, "explicit_paddings": {"list": {}}, "data_format": {"s": "TkhXQw=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "VkFMSUQ="}, "use_cudnn_on_gpu": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "moments_1/mean", "op": "Mean", "input": ["Conv2D_1", "moments_1/mean/reduction_indices"], "attr": {"keep_dims": {"b": true}, "Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "moments_1/SquaredDifference", "op": "SquaredDifference", "input": ["Conv2D_1", "moments_1/mean"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "sub_1", "op": "Sub", "input": ["Conv2D_1", "moments_1/mean"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "moments_1/variance", "op": "Mean", "input": ["moments_1/SquaredDifference", "moments_1/variance/reduction_indices"], "attr": {"Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "add_2", "op": "Add", "input": ["moments_1/variance", "Const_4"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "pow_1", "op": "Rsqrt", "input": ["add_2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "truediv_1", "op": "Mul", "input": ["Variable_5", "pow_1"], "attr": {"_grappler_ArithmeticOptimizer_MinimizeBroadcasts": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "mul_1", "op": "Mul", "input": ["truediv_1", "sub_1"], "attr": {"_grappler_ArithmeticOptimizer_MinimizeBroadcasts": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "add_3", "op": "Add", "input": ["mul_1", "Variable_4"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Relu_1", "op": "Relu", "input": ["add_3"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "MirrorPad_2", "op": "MirrorPad", "input": ["Relu_1", "Const_6"], "attr": {"mode": {"s": "UkVGTEVDVA=="}, "T": {"type": "DT_FLOAT"}, "Tpaddings": {"type": "DT_INT32"}}}, {"name": "Conv2D_2", "op": "Conv2D", "input": ["MirrorPad_2", "Variable_6"], "device": "/device:CPU:0", "attr": {"explicit_paddings": {"list": {}}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "T": {"type": "DT_FLOAT"}, "use_cudnn_on_gpu": {"b": true}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "VkFMSUQ="}, "data_format": {"s": "TkhXQw=="}}}, {"name": "moments_2/mean", "op": "Mean", "input": ["Conv2D_2", "moments_2/mean/reduction_indices"], "attr": {"keep_dims": {"b": true}, "Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "moments_2/SquaredDifference", "op": "SquaredDifference", "input": ["Conv2D_2", "moments_2/mean"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "sub_2", "op": "Sub", "input": ["Conv2D_2", "moments_2/mean"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "moments_2/variance", "op": "Mean", "input": ["moments_2/SquaredDifference", "moments_2/variance/reduction_indices"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "keep_dims": {"b": true}}}, {"name": "add_4", "op": "Add", "input": ["moments_2/variance", "Const_7"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "pow_2", "op": "Rsqrt", "input": ["add_4"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "truediv_2", "op": "Mul", "input": ["Variable_8", "pow_2"], "attr": {"T": {"type": "DT_FLOAT"}, "_grappler_ArithmeticOptimizer_MinimizeBroadcasts": {"b": true}}}, {"name": "mul_2", "op": "Mul", "input": ["truediv_2", "sub_2"], "attr": {"_grappler_ArithmeticOptimizer_MinimizeBroadcasts": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "add_5", "op": "Add", "input": ["mul_2", "Variable_7"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Relu_2", "op": "Relu", "input": ["add_5"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "MirrorPad_3", "op": "MirrorPad", "input": ["Relu_2", "Const_9"], "attr": {"Tpaddings": {"type": "DT_INT32"}, "mode": {"s": "UkVGTEVDVA=="}, "T": {"type": "DT_FLOAT"}}}, {"name": "Conv2D_3", "op": "Conv2D", "input": ["MirrorPad_3", "Variable_9"], "device": "/device:CPU:0", "attr": {"strides": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "VkFMSUQ="}, "use_cudnn_on_gpu": {"b": true}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}}, {"name": "moments_3/mean", "op": "Mean", "input": ["Conv2D_3", "moments_3/mean/reduction_indices"], "attr": {"keep_dims": {"b": true}, "T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}}}, {"name": "moments_3/SquaredDifference", "op": "SquaredDifference", "input": ["Conv2D_3", "moments_3/mean"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "sub_3", "op": "Sub", "input": ["Conv2D_3", "moments_3/mean"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "moments_3/variance", "op": "Mean", "input": ["moments_3/SquaredDifference", "moments_3/variance/reduction_indices"], "attr": {"keep_dims": {"b": true}, "Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "add_6", "op": "Add", "input": ["moments_3/variance", "Const_10"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "pow_3", "op": "Rsqrt", "input": ["add_6"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "truediv_3", "op": "Mul", "input": ["Variable_11", "pow_3"], "attr": {"_grappler_ArithmeticOptimizer_MinimizeBroadcasts": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "mul_3", "op": "Mul", "input": ["truediv_3", "sub_3"], "attr": {"_grappler_ArithmeticOptimizer_MinimizeBroadcasts": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "add_7", "op": "Add", "input": ["mul_3", "Variable_10"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Relu_3", "op": "Relu", "input": ["add_7"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "MirrorPad_4", "op": "MirrorPad", "input": ["Relu_3", "Const_12"], "attr": {"T": {"type": "DT_FLOAT"}, "mode": {"s": "UkVGTEVDVA=="}, "Tpaddings": {"type": "DT_INT32"}}}, {"name": "Conv2D_4", "op": "Conv2D", "input": ["MirrorPad_4", "Variable_12"], "device": "/device:CPU:0", "attr": {"use_cudnn_on_gpu": {"b": true}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "padding": {"s": "VkFMSUQ="}}}, {"name": "moments_4/mean", "op": "Mean", "input": ["Conv2D_4", "moments_4/mean/reduction_indices"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "keep_dims": {"b": true}}}, {"name": "moments_4/SquaredDifference", "op": "SquaredDifference", "input": ["Conv2D_4", "moments_4/mean"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "sub_4", "op": "Sub", "input": ["Conv2D_4", "moments_4/mean"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "moments_4/variance", "op": "Mean", "input": ["moments_4/SquaredDifference", "moments_4/variance/reduction_indices"], "attr": {"T": {"type": "DT_FLOAT"}, "keep_dims": {"b": true}, "Tidx": {"type": "DT_INT32"}}}, {"name": "add_8", "op": "Add", "input": ["moments_4/variance", "Const_13"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "pow_4", "op": "Rsqrt", "input": ["add_8"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "truediv_4", "op": "Mul", "input": ["Variable_14", "pow_4"], "attr": {"_grappler_ArithmeticOptimizer_MinimizeBroadcasts": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "mul_4", "op": "Mul", "input": ["truediv_4", "sub_4"], "attr": {"_grappler_ArithmeticOptimizer_MinimizeBroadcasts": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "add_9", "op": "Add", "input": ["mul_4", "Variable_13"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "add_10", "op": "Add", "input": ["Relu_2", "add_9"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "MirrorPad_5", "op": "MirrorPad", "input": ["add_10", "Const_15"], "attr": {"mode": {"s": "UkVGTEVDVA=="}, "T": {"type": "DT_FLOAT"}, "Tpaddings": {"type": "DT_INT32"}}}, {"name": "Conv2D_5", "op": "Conv2D", "input": ["MirrorPad_5", "Variable_15"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "use_cudnn_on_gpu": {"b": true}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "VkFMSUQ="}}}, {"name": "moments_5/mean", "op": "Mean", "input": ["Conv2D_5", "moments_5/mean/reduction_indices"], "attr": {"T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": true}}}, {"name": "moments_5/SquaredDifference", "op": "SquaredDifference", "input": ["Conv2D_5", "moments_5/mean"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "sub_5", "op": "Sub", "input": ["Conv2D_5", "moments_5/mean"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "moments_5/variance", "op": "Mean", "input": ["moments_5/SquaredDifference", "moments_5/variance/reduction_indices"], "attr": {"T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": true}}}, {"name": "add_11", "op": "Add", "input": ["moments_5/variance", "Const_16"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "pow_5", "op": "Rsqrt", "input": ["add_11"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "truediv_5", "op": "Mul", "input": ["Variable_17", "pow_5"], "attr": {"_grappler_ArithmeticOptimizer_MinimizeBroadcasts": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "mul_5", "op": "Mul", "input": ["truediv_5", "sub_5"], "attr": {"_grappler_ArithmeticOptimizer_MinimizeBroadcasts": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "add_12", "op": "Add", "input": ["mul_5", "Variable_16"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Relu_4", "op": "Relu", "input": ["add_12"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "MirrorPad_6", "op": "MirrorPad", "input": ["Relu_4", "Const_18"], "attr": {"Tpaddings": {"type": "DT_INT32"}, "mode": {"s": "UkVGTEVDVA=="}, "T": {"type": "DT_FLOAT"}}}, {"name": "Conv2D_6", "op": "Conv2D", "input": ["MirrorPad_6", "Variable_18"], "device": "/device:CPU:0", "attr": {"explicit_paddings": {"list": {}}, "T": {"type": "DT_FLOAT"}, "padding": {"s": "VkFMSUQ="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}}}, {"name": "moments_6/mean", "op": "Mean", "input": ["Conv2D_6", "moments_6/mean/reduction_indices"], "attr": {"Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "moments_6/SquaredDifference", "op": "SquaredDifference", "input": ["Conv2D_6", "moments_6/mean"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "sub_6", "op": "Sub", "input": ["Conv2D_6", "moments_6/mean"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "moments_6/variance", "op": "Mean", "input": ["moments_6/SquaredDifference", "moments_6/variance/reduction_indices"], "attr": {"T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": true}}}, {"name": "add_13", "op": "Add", "input": ["moments_6/variance", "Const_19"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "pow_6", "op": "Rsqrt", "input": ["add_13"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "truediv_6", "op": "Mul", "input": ["Variable_20", "pow_6"], "attr": {"T": {"type": "DT_FLOAT"}, "_grappler_ArithmeticOptimizer_MinimizeBroadcasts": {"b": true}}}, {"name": "mul_6", "op": "Mul", "input": ["truediv_6", "sub_6"], "attr": {"_grappler_ArithmeticOptimizer_MinimizeBroadcasts": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "add_14", "op": "Add", "input": ["mul_6", "Variable_19"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "add_15", "op": "Add", "input": ["add_10", "add_14"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "MirrorPad_7", "op": "MirrorPad", "input": ["add_15", "Const_21"], "attr": {"T": {"type": "DT_FLOAT"}, "mode": {"s": "UkVGTEVDVA=="}, "Tpaddings": {"type": "DT_INT32"}}}, {"name": "Conv2D_7", "op": "Conv2D", "input": ["MirrorPad_7", "Variable_21"], "device": "/device:CPU:0", "attr": {"strides": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "padding": {"s": "VkFMSUQ="}}}, {"name": "moments_7/mean", "op": "Mean", "input": ["Conv2D_7", "moments_7/mean/reduction_indices"], "attr": {"Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "moments_7/SquaredDifference", "op": "SquaredDifference", "input": ["Conv2D_7", "moments_7/mean"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "sub_7", "op": "Sub", "input": ["Conv2D_7", "moments_7/mean"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "moments_7/variance", "op": "Mean", "input": ["moments_7/SquaredDifference", "moments_7/variance/reduction_indices"], "attr": {"T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": true}}}, {"name": "add_16", "op": "Add", "input": ["moments_7/variance", "Const_22"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "pow_7", "op": "Rsqrt", "input": ["add_16"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "truediv_7", "op": "Mul", "input": ["Variable_23", "pow_7"], "attr": {"T": {"type": "DT_FLOAT"}, "_grappler_ArithmeticOptimizer_MinimizeBroadcasts": {"b": true}}}, {"name": "mul_7", "op": "Mul", "input": ["truediv_7", "sub_7"], "attr": {"_grappler_ArithmeticOptimizer_MinimizeBroadcasts": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "add_17", "op": "Add", "input": ["mul_7", "Variable_22"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Relu_5", "op": "Relu", "input": ["add_17"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "MirrorPad_8", "op": "MirrorPad", "input": ["Relu_5", "Const_24"], "attr": {"Tpaddings": {"type": "DT_INT32"}, "mode": {"s": "UkVGTEVDVA=="}, "T": {"type": "DT_FLOAT"}}}, {"name": "Conv2D_8", "op": "Conv2D", "input": ["MirrorPad_8", "Variable_24"], "device": "/device:CPU:0", "attr": {"explicit_paddings": {"list": {}}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}, "padding": {"s": "VkFMSUQ="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "moments_8/mean", "op": "Mean", "input": ["Conv2D_8", "moments_8/mean/reduction_indices"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "keep_dims": {"b": true}}}, {"name": "moments_8/SquaredDifference", "op": "SquaredDifference", "input": ["Conv2D_8", "moments_8/mean"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "sub_8", "op": "Sub", "input": ["Conv2D_8", "moments_8/mean"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "moments_8/variance", "op": "Mean", "input": ["moments_8/SquaredDifference", "moments_8/variance/reduction_indices"], "attr": {"keep_dims": {"b": true}, "Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "add_18", "op": "Add", "input": ["moments_8/variance", "Const_25"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "pow_8", "op": "Rsqrt", "input": ["add_18"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "truediv_8", "op": "Mul", "input": ["Variable_26", "pow_8"], "attr": {"T": {"type": "DT_FLOAT"}, "_grappler_ArithmeticOptimizer_MinimizeBroadcasts": {"b": true}}}, {"name": "mul_8", "op": "Mul", "input": ["truediv_8", "sub_8"], "attr": {"T": {"type": "DT_FLOAT"}, "_grappler_ArithmeticOptimizer_MinimizeBroadcasts": {"b": true}}}, {"name": "add_19", "op": "Add", "input": ["mul_8", "Variable_25"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "add_20", "op": "Add", "input": ["add_15", "add_19"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "MirrorPad_9", "op": "MirrorPad", "input": ["add_20", "Const_27"], "attr": {"mode": {"s": "UkVGTEVDVA=="}, "T": {"type": "DT_FLOAT"}, "Tpaddings": {"type": "DT_INT32"}}}, {"name": "Conv2D_9", "op": "Conv2D", "input": ["MirrorPad_9", "Variable_27"], "device": "/device:CPU:0", "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}, "use_cudnn_on_gpu": {"b": true}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "VkFMSUQ="}, "explicit_paddings": {"list": {}}}}, {"name": "moments_9/mean", "op": "Mean", "input": ["Conv2D_9", "moments_9/mean/reduction_indices"], "attr": {"Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "moments_9/SquaredDifference", "op": "SquaredDifference", "input": ["Conv2D_9", "moments_9/mean"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "sub_9", "op": "Sub", "input": ["Conv2D_9", "moments_9/mean"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "moments_9/variance", "op": "Mean", "input": ["moments_9/SquaredDifference", "moments_9/variance/reduction_indices"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "keep_dims": {"b": true}}}, {"name": "add_21", "op": "Add", "input": ["moments_9/variance", "Const_28"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "pow_9", "op": "Rsqrt", "input": ["add_21"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "truediv_9", "op": "Mul", "input": ["Variable_29", "pow_9"], "attr": {"_grappler_ArithmeticOptimizer_MinimizeBroadcasts": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "mul_9", "op": "Mul", "input": ["truediv_9", "sub_9"], "attr": {"T": {"type": "DT_FLOAT"}, "_grappler_ArithmeticOptimizer_MinimizeBroadcasts": {"b": true}}}, {"name": "add_22", "op": "Add", "input": ["mul_9", "Variable_28"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Relu_6", "op": "Relu", "input": ["add_22"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "MirrorPad_10", "op": "MirrorPad", "input": ["Relu_6", "Const_30"], "attr": {"T": {"type": "DT_FLOAT"}, "Tpaddings": {"type": "DT_INT32"}, "mode": {"s": "UkVGTEVDVA=="}}}, {"name": "Conv2D_10", "op": "Conv2D", "input": ["MirrorPad_10", "Variable_30"], "device": "/device:CPU:0", "attr": {"explicit_paddings": {"list": {}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "padding": {"s": "VkFMSUQ="}}}, {"name": "moments_10/mean", "op": "Mean", "input": ["Conv2D_10", "moments_10/mean/reduction_indices"], "attr": {"T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": true}}}, {"name": "moments_10/SquaredDifference", "op": "SquaredDifference", "input": ["Conv2D_10", "moments_10/mean"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "sub_10", "op": "Sub", "input": ["Conv2D_10", "moments_10/mean"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "moments_10/variance", "op": "Mean", "input": ["moments_10/SquaredDifference", "moments_10/variance/reduction_indices"], "attr": {"Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "add_23", "op": "Add", "input": ["moments_10/variance", "Const_31"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "pow_10", "op": "Rsqrt", "input": ["add_23"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "truediv_10", "op": "Mul", "input": ["Variable_32", "pow_10"], "attr": {"_grappler_ArithmeticOptimizer_MinimizeBroadcasts": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "mul_10", "op": "Mul", "input": ["truediv_10", "sub_10"], "attr": {"_grappler_ArithmeticOptimizer_MinimizeBroadcasts": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "add_24", "op": "Add", "input": ["mul_10", "Variable_31"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "add_25", "op": "Add", "input": ["add_20", "add_24"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "MirrorPad_11", "op": "MirrorPad", "input": ["add_25", "Const_33"], "attr": {"mode": {"s": "UkVGTEVDVA=="}, "Tpaddings": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "Conv2D_11", "op": "Conv2D", "input": ["MirrorPad_11", "Variable_33"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "padding": {"s": "VkFMSUQ="}, "explicit_paddings": {"list": {}}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "moments_11/mean", "op": "Mean", "input": ["Conv2D_11", "moments_11/mean/reduction_indices"], "attr": {"keep_dims": {"b": true}, "Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "moments_11/SquaredDifference", "op": "SquaredDifference", "input": ["Conv2D_11", "moments_11/mean"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "sub_11", "op": "Sub", "input": ["Conv2D_11", "moments_11/mean"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "moments_11/variance", "op": "Mean", "input": ["moments_11/SquaredDifference", "moments_11/variance/reduction_indices"], "attr": {"keep_dims": {"b": true}, "Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "add_26", "op": "Add", "input": ["moments_11/variance", "Const_34"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "pow_11", "op": "Rsqrt", "input": ["add_26"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "truediv_11", "op": "Mul", "input": ["Variable_35", "pow_11"], "attr": {"_grappler_ArithmeticOptimizer_MinimizeBroadcasts": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "mul_11", "op": "Mul", "input": ["truediv_11", "sub_11"], "attr": {"_grappler_ArithmeticOptimizer_MinimizeBroadcasts": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "add_27", "op": "Add", "input": ["mul_11", "Variable_34"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Relu_7", "op": "Relu", "input": ["add_27"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "MirrorPad_12", "op": "MirrorPad", "input": ["Relu_7", "Const_36"], "attr": {"mode": {"s": "UkVGTEVDVA=="}, "Tpaddings": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "Conv2D_12", "op": "Conv2D", "input": ["MirrorPad_12", "Variable_36"], "device": "/device:CPU:0", "attr": {"use_cudnn_on_gpu": {"b": true}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "explicit_paddings": {"list": {}}, "padding": {"s": "VkFMSUQ="}}}, {"name": "moments_12/mean", "op": "Mean", "input": ["Conv2D_12", "moments_12/mean/reduction_indices"], "attr": {"T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": true}}}, {"name": "moments_12/SquaredDifference", "op": "SquaredDifference", "input": ["Conv2D_12", "moments_12/mean"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "sub_12", "op": "Sub", "input": ["Conv2D_12", "moments_12/mean"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "moments_12/variance", "op": "Mean", "input": ["moments_12/SquaredDifference", "moments_12/variance/reduction_indices"], "attr": {"keep_dims": {"b": true}, "Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "add_28", "op": "Add", "input": ["moments_12/variance", "Const_37"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "pow_12", "op": "Rsqrt", "input": ["add_28"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "truediv_12", "op": "Mul", "input": ["Variable_38", "pow_12"], "attr": {"_grappler_ArithmeticOptimizer_MinimizeBroadcasts": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "mul_12", "op": "Mul", "input": ["truediv_12", "sub_12"], "attr": {"_grappler_ArithmeticOptimizer_MinimizeBroadcasts": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "add_29", "op": "Add", "input": ["mul_12", "Variable_37"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "add_30", "op": "Add", "input": ["add_25", "add_29"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "conv2d_transpose", "op": "Conv2DBackpropInput", "input": ["stack", "Variable_39", "add_30"], "attr": {"strides": {"list": {"i": ["1", "2", "2", "1"]}}, "T": {"type": "DT_FLOAT"}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}}}, {"name": "moments_13/mean", "op": "Mean", "input": ["conv2d_transpose", "moments_13/mean/reduction_indices"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "keep_dims": {"b": true}}}, {"name": "moments_13/SquaredDifference", "op": "SquaredDifference", "input": ["conv2d_transpose", "moments_13/mean"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "sub_13", "op": "Sub", "input": ["conv2d_transpose", "moments_13/mean"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "moments_13/variance", "op": "Mean", "input": ["moments_13/SquaredDifference", "moments_13/variance/reduction_indices"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "keep_dims": {"b": true}}}, {"name": "add_31", "op": "Add", "input": ["moments_13/variance", "Const_39"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "pow_13", "op": "Rsqrt", "input": ["add_31"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "truediv_13", "op": "Mul", "input": ["Variable_41", "pow_13"], "attr": {"T": {"type": "DT_FLOAT"}, "_grappler_ArithmeticOptimizer_MinimizeBroadcasts": {"b": true}}}, {"name": "mul_13", "op": "Mul", "input": ["truediv_13", "sub_13"], "attr": {"_grappler_ArithmeticOptimizer_MinimizeBroadcasts": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "add_32", "op": "Add", "input": ["mul_13", "Variable_40"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Relu_8", "op": "Relu", "input": ["add_32"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "conv2d_transpose_1", "op": "Conv2DBackpropInput", "input": ["stack_1", "Variable_42", "Relu_8"], "attr": {"explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "padding": {"s": "U0FNRQ=="}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}}}, {"name": "moments_14/mean", "op": "Mean", "input": ["conv2d_transpose_1", "moments_14/mean/reduction_indices"], "attr": {"Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "moments_14/SquaredDifference", "op": "SquaredDifference", "input": ["conv2d_transpose_1", "moments_14/mean"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "sub_14", "op": "Sub", "input": ["conv2d_transpose_1", "moments_14/mean"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "moments_14/variance", "op": "Mean", "input": ["moments_14/SquaredDifference", "moments_14/variance/reduction_indices"], "attr": {"Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "add_33", "op": "Add", "input": ["moments_14/variance", "Const_41"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "pow_14", "op": "Rsqrt", "input": ["add_33"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "truediv_14", "op": "Mul", "input": ["Variable_44", "pow_14"], "attr": {"T": {"type": "DT_FLOAT"}, "_grappler_ArithmeticOptimizer_MinimizeBroadcasts": {"b": true}}}, {"name": "mul_14", "op": "Mul", "input": ["truediv_14", "sub_14"], "attr": {"_grappler_ArithmeticOptimizer_MinimizeBroadcasts": {"b": true}, "T": 